OpenFOAM/OpenFOAM-7/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23301;

boundaryField
{
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ground
    {
        type            zeroGradient;
    }

    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(region0_to.*)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
